# Список суміжності для графа транспортного сполучення Одеси
import networkx as nx
import matplotlib.pyplot as plt

def get_graf(is_weigted=False):
    # Створення графа
    G = nx.Graph()

    if is_weigted:
        G = {
            'Залізничний вокзал': {'Привоз':1, 'Парк Шевченка':3, 'Площа Толбухіна':4},
            'Привоз': {'Міський сад':2, 'Вул. Пастера':3},
            'Парк Шевченка': {'Оперний театр':2},
            'Площа Толбухіна': {'Центральний автовокзал':6},
            'Міський сад': {'Аркадія':6, 'Оперний театр':1},
            'Оперний театр': {'Вул. Дерибасівська':1},
            'Вул. Пастера': {'Центральний автовокзал':3},
            'Аркадія': {'Центральний автовокзал':5, 'Фонтанська дорога':3},
            'Фонтанська дорога': {'Вул. Ільфа і Петрова':4},
            'Вул. Ільфа і Петрова': {'Таїрово':4},
            'Центральний автовокзал': {},
            'Вул. Дерибасівська': {},
            'Таїрово': {}
        }
    else:
        G.add_edges_from([
            ('Залізничний вокзал', 'Привоз'),
            ('Залізничний вокзал', 'Парк Шевченка'),
            ('Залізничний вокзал', 'Площа Толбухіна'),
            ('Привоз', 'Міський сад'),
            ('Привоз', 'Вул. Пастера'),
            ('Парк Шевченка', 'Оперний театр'),
            ('Площа Толбухіна', 'Центральний автовокзал'),
            ('Міський сад', 'Аркадія'),
            ('Міський сад', 'Оперний театр'),
            ('Оперний театр', 'Вул. Дерибасівська'),
            ('Вул. Пастера', 'Центральний автовокзал'),
            ('Аркадія', 'Центральний автовокзал'),
            ('Аркадія', 'Фонтанська дорога'),
            ('Фонтанська дорога', 'Вул. Ільфа і Петрова'),
            ('Вул. Ільфа і Петрова', 'Таїрово')
        ])
    return G

def plot_graf(graf):
    # Візуалізація графа
    pos = nx.spring_layout(graf)
    labels = nx.get_edge_attributes(graf,'weight')
    nx.draw_networkx_edge_labels(graf, pos, edge_labels=labels)
    nx.draw(graf, pos, with_labels=True, node_color='lightgreen', node_size=500, font_size=8, font_weight='bold', edge_color='gray')
    plt.title("Граф транспортної мережі міста Одеса")
    plt.show()

def main():
    # Створення графа
    G = get_graf()
    # Візуалізація графа
    plot_graf(G)

    # Аналіз основних характеристик
    print(f"Кількість вершин: {G.number_of_nodes()}")
    print(f"Кількість ребер: {G.number_of_edges()}")
    print(f"Ступені вершин: {dict(G.degree())}")


if __name__ == "__main__":
    main()
